Тест_ЗУП_31_КОРП/src/InformationRegisters/ИзменениеСведенийФизическихЛиц/ИзменениеСведенийФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзменениеСведенийФизическихЛиц</name>
  <resources>
    <name>ПрежнееЗначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УстановленноеЗначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияСведений</name>
    <type>
      <types>EnumRef.КатегорииСведенийОФизическихЛицах</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ВоинскийУчет/ВоинскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВоинскийУчет</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ОтношениеКВоинскойОбязанности</name>
    <type>
      <types>EnumRef.ОтношениеКВоинскойОбязанности</types>
    </type>
  </resources>
  <resources>
    <name>ОтношениеКВоинскомуУчету</name>
    <type>
      <types>EnumRef.ОтношениеКВоинскомуУчету</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияЗапаса</name>
    <type>
      <types>EnumRef.КатегорииЗапасаВоеннообязанных</types>
    </type>
  </resources>
  <resources>
    <name>Звание</name>
    <type>
      <types>CatalogRef.ЗванияГражданскогоВоинскогоУчета</types>
    </type>
  </resources>
  <resources>
    <name>Состав</name>
    <type>
      <types>CatalogRef.СоставыВоеннослужащих</types>
    </type>
  </resources>
  <resources>
    <name>ВУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Годность</name>
    <type>
      <types>EnumRef.ГодностьКВоеннойСлужбе</types>
    </type>
  </resources>
  <resources>
    <name>Военкомат</name>
    <type>
      <types>CatalogRef.Военкоматы</types>
    </type>
  </resources>
  <resources>
    <name>НаличиеМобпредписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерКомандыПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПеречня</name>
    <type>
      <types>CatalogRef.ПереченьДолжностейДляБронированияГраждан</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Enums/КатегорииСведенийОФизическихЛицах/КатегорииСведенийОФизическихЛицах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСведенийОФизическихЛицах</name>
  <enumValues>
    <name>Должность</name>
  </enumValues>
  <enumValues>
    <name>Инвалидность</name>
  </enumValues>
  <enumValues>
    <name>КонтактнаяИнформация</name>
  </enumValues>
  <enumValues>
    <name>Образование</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>СемейноеПоложение</name>
  </enumValues>
  <enumValues>
    <name>СоставСемьи</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ВидыПрофессиональнойПодготовки/ВидыПрофессиональнойПодготовки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрофессиональнойПодготовки</name>
  <enumValues>
    <name>Переподготовка</name>
  </enumValues>
  <enumValues>
    <name>ПовышениеКвалификации</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ОтношениеКВоинскойОбязанности/ОтношениеКВоинскойОбязанности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтношениеКВоинскойОбязанности</name>
  <enumValues>
    <name>Военнообязанный</name>
  </enumValues>
  <enumValues>
    <name>НеВоеннообязанный</name>
  </enumValues>
  <enumValues>
    <name>Призывник</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ОтношениеКВоинскомуУчету/ОтношениеКВоинскомуУчету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтношениеКВоинскомуУчету</name>
  <enumValues>
    <name>Состоит</name>
  </enumValues>
  <enumValues>
    <name>Встает</name>
  </enumValues>
  <enumValues>
    <name>НеСостоит</name>
  </enumValues>
  <enumValues>
    <name>СнятПоВозрасту</name>
  </enumValues>
  <enumValues>
    <name>СнятПоСостояниюЗдоровья</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ОбразованиеФизическихЛиц/ОбразованиеФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбразованиеФизическихЛиц</name>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>УдалитьОсновноеОбразование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПослевузовскогоОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебноеЗаведение</name>
    <type>
      <types>CatalogRef.УчебныеЗаведения</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовОбОбразовании</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДополнительногоОбучения</name>
    <type>
      <types>EnumRef.ВидыПрофессиональнойПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДокументОснование</name>
    <type>
      <types>DocumentRef.ОбучениеРазвитиеСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/РодственникиФизическихЛиц/РодственникиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РодственникиФизическихЛиц</name>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>СтепеньРодства</name>
    <type>
      <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаИждивении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/CommonModules/ВоинскийУчетСобытия/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьИзменениеАдресаФизическогоЛицаПередЗаписью(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФизическоеЛицо = Источник.Ссылка;
	
	Период = ТекущаяДатаСеанса();
	
	Если Отказ Или Не ЗначениеЗаполнено(ФизическоеЛицо) Или Не ВоеннообязанныйРаботник(Источник.Ссылка, Период) Тогда 
		Возврат;
	КонецЕсли;	
	
	АдресМестаПроживания = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид", АдресМестаПроживания);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛицаКонтактнаяИнформация.Тип,
	               |	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
	               |	ФизическиеЛицаКонтактнаяИнформация.Представление
	               |ИЗ
	               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	               |ГДЕ
	               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ФизическоеЛицо
	               |	И ФизическиеЛицаКонтактнаяИнформация.Вид = &Вид
	               |	И ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗаписейБазыДанных = РезультатЗапроса.Выгрузить();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	СтруктураОтбора.Вставить("Вид", АдресМестаПроживания);
	
	ТаблицаЗаписейОбъекта = Источник.КонтактнаяИнформация.Выгрузить(СтруктураОтбора, "Тип, Вид, Представление");
	
	УдалитьСовпадающиеСтрокиТаблиц(ТаблицаЗаписейБазыДанных, ТаблицаЗаписейОбъекта);
	
	Если Не ОбщегоНазначения.КоллекцииИдентичны(ТаблицаЗаписейОбъекта, ТаблицаЗаписейБазыДанных) Тогда 
		
		ПрежниеАдреса 		= "";
		УстановленныеАдреса = "";
		
		Для Каждого ТекСтрока Из ТаблицаЗаписейБазыДанных Цикл 
			ПрежниеАдреса = ПрежниеАдреса + ?(ЗначениеЗаполнено(ПрежниеАдреса), Символы.ПС, "") + ТекСтрока.Вид + ": " + ТекСтрока.Представление;
		КонецЦикла;
		
		Для Каждого ТекСтрока Из ТаблицаЗаписейОбъекта Цикл 
			УстановленныеАдреса = УстановленныеАдреса + ?(ЗначениеЗаполнено(УстановленныеАдреса), Символы.ПС, "") + ТекСтрока.Вид + ": " + ТекСтрока.Представление;
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.ИзменениеСведенийФизическихЛиц.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ДатаЗаписи.Установить(Период);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
		НаборЗаписей.Отбор.КатегорияСведений.Установить(Перечисления.КатегорииСведенийОФизическихЛицах.КонтактнаяИнформация);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.ДатаЗаписи 			  = Период;
		НоваяЗапись.ФизическоеЛицо 		  = ФизическоеЛицо;
		НоваяЗапись.КатегорияСведений 	  = Перечисления.КатегорииСведенийОФизическихЛицах.КонтактнаяИнформация;
		НоваяЗапись.ПрежнееЗначение 	  = ПрежниеАдреса;
		НоваяЗапись.УстановленноеЗначение = УстановленныеАдреса;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеОбразованияФизическогоЛицаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоДополнительноеОбразование() Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФизическоеЛицо = Источник.Владелец;
	Период = ТекущаяДатаСеанса();
	
	Если Отказ Или Не ВоеннообязанныйРаботник(ФизическоеЛицо, Период) Тогда 
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбразованиеФЛ.Ссылка,
	|	ОбразованиеФЛ.Владелец КАК ФизическоеЛицо,
	|	ОбразованиеФЛ.УчебноеЗаведение,
	|	ОбразованиеФЛ.ВидОбразования,
	|	ОбразованиеФЛ.ВидДополнительногоОбучения,
	|	ОбразованиеФЛ.Специальность,
	|	ОбразованиеФЛ.Окончание,
	|	ОбразованиеФЛ.Квалификация
	|ИЗ
	|	Справочник.ОбразованиеФизическихЛиц КАК ОбразованиеФЛ
	|ГДЕ
	|	ОбразованиеФЛ.Владелец = &ФизическоеЛицо
	|	И ОбразованиеФЛ.ВидОбразования <> ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование)
	|	И ОбразованиеФЛ.ВидДополнительногоОбучения <> ЗНАЧЕНИЕ(Перечисление.ВидыПрофессиональнойПодготовки.Переподготовка)
	|	И ОбразованиеФЛ.ВидДополнительногоОбучения <> ЗНАЧЕНИЕ(Перечисление.ВидыПрофессиональнойПодготовки.ПовышениеКвалификации)
	|	И НЕ ОбразованиеФЛ.ПометкаУдаления";
	
	ТаблицаЗаписейБазыДанных = Запрос.Выполнить().Выгрузить();
	НоваяТаблицаЗаписей 	 = ТаблицаЗаписейБазыДанных.Скопировать();
	
	СтрокаСсылки = НоваяТаблицаЗаписей.Найти(Источник.Ссылка, "Ссылка");
	Если СтрокаСсылки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтрокаСсылки, Источник, "УчебноеЗаведение,ВидОбразования,ВидДополнительногоОбучения,Специальность,Окончание,Квалификация");
	КонецЕсли; 
	
	УдалитьСовпадающиеСтрокиТаблиц(ТаблицаЗаписейБазыДанных, НоваяТаблицаЗаписей);
	
	Если Не ОбщегоНазначения.КоллекцииИдентичны(НоваяТаблицаЗаписей, ТаблицаЗаписейБазыДанных) Тогда 
		
		ПрежнееОбразование 		 = "";
		УстановленноеОбразование = "";
		
		Для Каждого ТекСтрока Из ТаблицаЗаписейБазыДанных Цикл
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(ТекСтрока);
			
			ПрежнееОбразование = ПрежнееОбразование + ?(ЗначениеЗаполнено(ПрежнееОбразование), Символы.ПС, "") 
				+ Справочники.ОбразованиеФизическихЛиц.ПредставлениеСведенийОбОбразовании(МассивСтрок);
			
		КонецЦикла;
		
		Для Каждого ТекСтрока Из НоваяТаблицаЗаписей Цикл
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(ТекСтрока);
			
			УстановленноеОбразование = УстановленноеОбразование + ?(ЗначениеЗаполнено(УстановленноеОбразование), Символы.ПС, "") 
				+ Справочники.ОбразованиеФизическихЛиц.ПредставлениеСведенийОбОбразовании(МассивСтрок);
			
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.ИзменениеСведенийФизическихЛиц.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ДатаЗаписи.Установить(Период);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
		НаборЗаписей.Отбор.КатегорияСведений.Установить(Перечисления.КатегорииСведенийОФизическихЛицах.Образование);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.ДатаЗаписи 			  = Период;
		НоваяЗапись.ФизическоеЛицо 		  = ФизическоеЛицо;
		НоваяЗапись.КатегорияСведений 	  = Перечисления.КатегорииСведенийОФизическихЛицах.Образование;
		НоваяЗапись.ПрежнееЗначение 	  = ПрежнееОбразование;
		НоваяЗапись.УстановленноеЗначение = УстановленноеОбразование;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеСоставаСемьиФизическогоЛицаПередЗаписью(Источник, Отказ, Замещение) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФизическоеЛицо = Источник.Владелец;
	
	Период = ТекущаяДатаСеанса();
	Если Отказ Или Не ВоеннообязанныйРаботник(ФизическоеЛицо, Период) Тогда 
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодственникиФизическихЛиц.Владелец КАК ФизическоеЛицо,
		|	РодственникиФизическихЛиц.СтепеньРодства,
		|	РодственникиФизическихЛиц.Наименование КАК ФИО,
		|	РодственникиФизическихЛиц.ДатаРождения,
		|	РодственникиФизическихЛиц.Ссылка
		|ИЗ
		|	Справочник.РодственникиФизическихЛиц КАК РодственникиФизическихЛиц
		|ГДЕ
		|	РодственникиФизическихЛиц.Владелец = &ФизическоеЛицо";
	
	ТаблицаЗаписейБазыДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаЗаписейНабора = ТаблицаЗаписейБазыДанных.Скопировать();
	
	СтрокаНабора = ТаблицаЗаписейНабора.Найти(Источник.Ссылка, "Ссылка");
	
	Если Источник.ЭтоНовый() Или СтрокаНабора = Неопределено Тогда
		
		СтрокаНабора = ТаблицаЗаписейНабора.Добавить();
		СтрокаНабора.Ссылка = Источник.Ссылка;
		СтрокаНабора.ФизическоеЛицо = Источник.Владелец;
		
	КонецЕсли;
	
	СтрокаНабора.СтепеньРодства = Источник.СтепеньРодства;
	СтрокаНабора.ФИО = Источник.Наименование;
	СтрокаНабора.ДатаРождения = Источник.ДатаРождения;
				
	УдалитьСовпадающиеСтрокиТаблиц(ТаблицаЗаписейБазыДанных, ТаблицаЗаписейНабора);
	Если Не ОбщегоНазначения.КоллекцииИдентичны(ТаблицаЗаписейНабора, ТаблицаЗаписейБазыДанных) Тогда 
		
		ПрежнийСоставСемьи 		 = "";
		УстановленныйСоставСемьи = "";
		
		Для Каждого ТекСтрока Из ТаблицаЗаписейБазыДанных Цикл
			
			ПрежнийСоставСемьи = ПрежнийСоставСемьи + ?(ЗначениеЗаполнено(ПрежнийСоставСемьи), Символы.ПС, "") 
				+ ТекСтрока.СтепеньРодства + ?(ЗначениеЗаполнено(ТекСтрока.ФИО), " - ", "") + ТекСтрока.ФИО 
				+ ?(ЗначениеЗаполнено(ТекСтрока.ДатаРождения), ", ", "") + Формат(ТекСтрока.ДатаРождения, "ДЛФ=Д");
			
		КонецЦикла;
		
		Для Каждого ТекСтрока Из ТаблицаЗаписейНабора Цикл
			
			УстановленныйСоставСемьи = УстановленныйСоставСемьи + ?(ЗначениеЗаполнено(УстановленныйСоставСемьи), Символы.ПС, "") 
				+ ТекСтрока.СтепеньРодства + ?(ЗначениеЗаполнено(ТекСтрока.ФИО), " - ", "") + ТекСтрока.ФИО 
				+ ?(ЗначениеЗаполнено(ТекСтрока.ДатаРождения), ", ", "") + Формат(ТекСтрока.ДатаРождения, "ДЛФ=Д");
			
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.ИзменениеСведенийФизическихЛиц.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ДатаЗаписи.Установить(Период);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
		НаборЗаписей.Отбор.КатегорияСведений.Установить(Перечисления.КатегорииСведенийОФизическихЛицах.СоставСемьи);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.ДатаЗаписи 			  = Период;
		НоваяЗапись.ФизическоеЛицо 		  = ФизическоеЛицо;
		НоваяЗапись.КатегорияСведений 	  = Перечисления.КатегорииСведенийОФизическихЛицах.СоставСемьи;
		НоваяЗапись.ПрежнееЗначение 	  = ПрежнийСоставСемьи;
		НоваяЗапись.УстановленноеЗначение = УстановленныйСоставСемьи;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет, подлежит ли физическое лицо воинскому учету.
//
Функция ВоеннообязанныйРаботник(ФизическоеЛицо, Период)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Период", Период);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВоинскийУчетСрезПоследних.ФизическоеЛицо
	               |ИЗ
	               |	РегистрСведений.ВоинскийУчет.СрезПоследних(
	               |			&Период,
	               |			ФизическоеЛицо = &ФизическоеЛицо
	               |				И ОтношениеКВоинскойОбязанности В (ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Призывник), ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный))
	               |				И НЕ ОтношениеКВоинскомуУчету В (ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту), ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья))) КАК ВоинскийУчетСрезПоследних";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура УдалитьСовпадающиеСтрокиТаблиц(ПерваяТаблица, ВтораяТаблица)
	
	ПерваяТаблицаИтоговая = ПерваяТаблица.СкопироватьКолонки();
	ВтораяТаблицаИтоговая = ВтораяТаблица.СкопироватьКолонки();
	
	Для Каждого ТекСтрока Из ПерваяТаблица Цикл 
		
		СтруктураОтбора = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТекСтрока);
		
		МассивСтрок = ВтораяТаблица.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда 
			НоваяСтрока = ПерваяТаблицаИтоговая.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ВтораяТаблица Цикл 
		
		СтруктураОтбора = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТекСтрока);
		
		МассивСтрок = ПерваяТаблица.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда 
			НоваяСтрока = ВтораяТаблицаИтоговая.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	ПерваяТаблица = ПерваяТаблицаИтоговая;
	ВтораяТаблица = ВтораяТаблицаИтоговая;
	
КонецПроцедуры

#КонецОбласти
